add memory docs
